START_MESSAGE = "Вас приветствует Global Trade Bot! 👋🤖\n\nЯ умею:\n- отслеживать товары\n- выдавать информацию о готовых посылках на пункте выдачи\n- учиться чему то новому со временем 😉\n\nЧем я могу вам помочь?"

KEYBOARD_MESSAGES = [
    "❓ Как пользоваться ботом?",
    "📦 Отследить посылку",
    "✅ Готовые посылки",
]

GET_COMMODITY_MESSAGE = (
    "Отлично, давайте я посмотрю где находится ваша посылка 🎉\n"
    "Вам нужно просто ввести трек код чтобы получить всю информацию о вашей посылки. ⬇️: "
)

NO_CORRECT_INVOICE_MESSAGE = (
    "Вы ввели неправильный трек код, это может быть из-за того, что: \n"
    "1 - Ваша посылка еще не приехала к нам на склад \n"
    "2 - Вы ввели некоректный трек код «Как посмотреть трек код вашего товара? "
    "Вы можете посмотреть этот короткий видеоурок⬇️»"
)

VIDEO_FILE_ID = "BAACAgIAAxkBAANuZ9MQVtqwBFZtU6ga9wgB2E580rsAAuphAAIVjBBICMcCRJEIC9U2BA"

IS_VALID_MESSAGE = (
    "Вы ввели неправильную команду. ❌\nПожалуйста, выберите опцию из меню: 📝"
)

GET_CLIENT_CODE_MESSAGE = "Введите ваш клиентский код на английском (пример: KK-ваш код) 🔢📝"
GET_NAME_MESSAGE = "Введите ваше имя ✍️😊(на русском)"
GET_PHONE_NUMBER_MESSAGE = "Введите ваш номер телефона 📱🔢"


ADMIN_GET_CLIENT_CODE_MESSAGE = "Введите клиентский код (пример KK-ваш код) 🔢📝"
ADMIN_GET_NAME_MESSAGE = "Введите имя ✍️😊"
ADMIN_GET_PHONE_NUMBER_MESSAGE = "Введите номер телефона 📱🔢"
