START_MESSAGE = "Вас приветствует Global Trade Bot! 👋🤖\nЧем я могу вам помочь?"

KEYBOARD_MESSAGES = [
    "❓ Как пользоваться?",
    "📦 Где мой товар?",
    "✅ Готовые посылки",
]

GET_COMMODITY_MESSAGE = (
    "Отлично, давайте я посмотрю где находится ваша посылка 🎉\n"
    "Вам нужно просто ввести трек код чтобы получить всю информацию о вашей посылки. ⬇️: "
)

NO_CORRECT_INVOICE_MESSAGE = (
    "Вы ввели неправильный трек код, это может быть из-за того, что: \n"
    "1 - Ваша посылка еще не приехала к нам на склад \n"
    "2 - Вы ввели некоректный трек код «Как посмотреть трек код вашего товара? "
    "Вы можете посмотреть этот короткий видеоурок⬇️»"
)

VIDEO_FILE_ID = "BAACAgIAAxkBAANuZ9MQVtqwBFZtU6ga9wgB2E580rsAAuphAAIVjBBICMcCRJEIC9U2BA"

IS_VALID_MESSAGE = (
    "Вы ввели неправильную команду. ❌\nПожалуйста, выберите опцию из меню: 📝"
)

GET_CLIENT_CODE_MESSAGE = "Введите ваш клиентский номер (пример KK-601) 🔢📝"
GET_NAME_MESSAGE = "Введите ваше имя ✍️😊"
GET_PHONE_NUMBER_MESSAGE = "Введите ваш номер телефона 📱🔢"


ADMIN_GET_CLIENT_CODE_MESSAGE = "Введите клиентский номер (пример KK-601) 🔢📝"
ADMIN_GET_NAME_MESSAGE = "Введите имя ✍️😊"
ADMIN_GET_PHONE_NUMBER_MESSAGE = "Введите номер телефона 📱🔢"
